Masmiseim36/nxpSDK/devices/MIMXRT1046/MIMXRT1046.xml
        <register>
          <name>OPACR2</name>
          <description>Off-Platform Peripheral Access Control Registers</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x44444444</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OPAC23</name>
              <description>Off-platform Peripheral Access Control 23</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TP0</name>
                  <description>Accesses from an untrusted master are allowed.</description>
                  <value>#xxx0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TP1</name>
                  <description>Accesses from an untrusted master are not allowed. If an access is attempted by an untrusted master, the access is terminated with an error response and no peripheral access is initiated on the IPS bus.</description>
                  <value>#xxx1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OPAC22</name>
              <description>Off-platform Peripheral Access Control 22</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TP0</name>
                  <description>Accesses from an untrusted master are allowed.</description>
                  <value>#xxx0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TP1</name>
                  <description>Accesses from an untrusted master are not allowed. If an access is attempted by an untrusted master, the access is terminated with an error response and no peripheral access is initiated on the IPS bus.</description>
                  <value>#xxx1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OPAC21</name>
              <description>Off-platform Peripheral Access Control 21</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TP0</name>
                  <description>Accesses from an untrusted master are allowed.</description>
                  <value>#xxx0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TP1</name>
                  <description>Accesses from an untrusted master are not allowed. If an access is attempted by an untrusted master, the access is terminated with an error response and no peripheral access is initiated on the IPS bus.</description>
                  <value>#xxx1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OPAC20</name>
              <description>Off-platform Peripheral Access Control 20</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TP0</name>
                  <description>Accesses from an untrusted master are allowed.</description>
                  <value>#xxx0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TP1</name>
                  <description>Accesses from an untrusted master are not allowed. If an access is attempted by an untrusted master, the access is terminated with an error response and no peripheral access is initiated on the IPS bus.</description>
                  <value>#xxx1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OPAC19</name>
              <description>Off-platform Peripheral Access Control 19</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TP0</name>
                  <description>Accesses from an untrusted master are allowed.</description>
                  <value>#xxx0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TP1</name>
                  <description>Accesses from an untrusted master are not allowed. If an access is attempted by an untrusted master, the access is terminated with an error response and no peripheral access is initiated on the IPS bus.</description>
                  <value>#xxx1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OPAC18</name>
              <description>Off-platform Peripheral Access Control 18</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TP0</name>
                  <description>Accesses from an untrusted master are allowed.</description>
                  <value>#xxx0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TP1</name>
                  <description>Accesses from an untrusted master are not allowed. If an access is attempted by an untrusted master, the access is terminated with an error response and no peripheral access is initiated on the IPS bus.</description>
                  <value>#xxx1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OPAC17</name>
              <description>Off-platform Peripheral Access Control 17</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TP0</name>
                  <description>Accesses from an untrusted master are allowed.</description>
                  <value>#xxx0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TP1</name>
                  <description>Accesses from an untrusted master are not allowed. If an access is attempted by an untrusted master, the access is terminated with an error response and no peripheral access is initiated on the IPS bus.</description>
                  <value>#xxx1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OPAC16</name>
              <description>Off-platform Peripheral Access Control 16</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TP0</name>
                  <description>Accesses from an untrusted master are allowed.</description>
                  <value>#xxx0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TP1</name>
                  <description>Accesses from an untrusted master are not allowed. If an access is attempted by an untrusted master, the access is terminated with an error response and no peripheral access is initiated on the IPS bus.</description>
                  <value>#xxx1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>OPACR3</name>
          <description>Off-Platform Peripheral Access Control Registers</description>
          <addressOffset>0x4C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x44444444</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OPAC31</name>
              <description>Off-platform Peripheral Access Control 31</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TP0</name>
                  <description>Accesses from an untrusted master are allowed.</description>
                  <value>#xxx0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TP1</name>
                  <description>Accesses from an untrusted master are not allowed. If an access is attempted by an untrusted master, the access is terminated with an error response and no peripheral access is initiated on the IPS bus.</description>
                  <value>#xxx1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OPAC30</name>
              <description>Off-platform Peripheral Access Control 30</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TP0</name>
                  <description>Accesses from an untrusted master are allowed.</description>
                  <value>#xxx0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TP1</name>
                  <description>Accesses from an untrusted master are not allowed. If an access is attempted by an untrusted master, the access is terminated with an error response and no peripheral access is initiated on the IPS bus.</description>
                  <value>#xxx1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OPAC29</name>
              <description>Off-platform Peripheral Access Control 29</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TP0</name>
                  <description>Accesses from an untrusted master are allowed.</description>
                  <value>#xxx0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TP1</name>
                  <description>Accesses from an untrusted master are not allowed. If an access is attempted by an untrusted master, the access is terminated with an error response and no peripheral access is initiated on the IPS bus.</description>
                  <value>#xxx1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OPAC28</name>
              <description>Off-platform Peripheral Access Control 28</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TP0</name>
                  <description>Accesses from an untrusted master are allowed.</description>
                  <value>#xxx0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TP1</name>
                  <description>Accesses from an untrusted master are not allowed. If an access is attempted by an untrusted master, the access is terminated with an error response and no peripheral access is initiated on the IPS bus.</description>
                  <value>#xxx1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OPAC27</name>
              <description>Off-platform Peripheral Access Control 27</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TP0</name>
                  <description>Accesses from an untrusted master are allowed.</description>
                  <value>#xxx0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TP1</name>
                  <description>Accesses from an untrusted master are not allowed. If an access is attempted by an untrusted master, the access is terminated with an error response and no peripheral access is initiated on the IPS bus.</description>
                  <value>#xxx1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OPAC26</name>
              <description>Off-platform Peripheral Access Control 26</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TP0</name>
                  <description>Accesses from an untrusted master are allowed.</description>
                  <value>#xxx0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TP1</name>
                  <description>Accesses from an untrusted master are not allowed. If an access is attempted by an untrusted master, the access is terminated with an error response and no peripheral access is initiated on the IPS bus.</description>
                  <value>#xxx1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OPAC25</name>
              <description>Off-platform Peripheral Access Control 25</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TP0</name>
                  <description>Accesses from an untrusted master are allowed.</description>
                  <value>#xxx0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TP1</name>
                  <description>Accesses from an untrusted master are not allowed. If an access is attempted by an untrusted master, the access is terminated with an error response and no peripheral access is initiated on the IPS bus.</description>
                  <value>#xxx1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OPAC24</name>
              <description>Off-platform Peripheral Access Control 24</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TP0</name>
                  <description>Accesses from an untrusted master are allowed.</description>
                  <value>#xxx0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TP1</name>
                  <description>Accesses from an untrusted master are not allowed. If an access is attempted by an untrusted master, the access is terminated with an error response and no peripheral access is initiated on the IPS bus.</description>
                  <value>#xxx1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>OPACR4</name>
          <description>Off-Platform Peripheral Access Control Registers</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x44444444</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OPAC33</name>
              <description>Off-platform Peripheral Access Control 33</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TP0</name>
                  <description>Accesses from an untrusted master are allowed.</description>
                  <value>#xxx0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TP1</name>
                  <description>Accesses from an untrusted master are not allowed. If an access is attempted by an untrusted master, the access is terminated with an error response and no peripheral access is initiated on the IPS bus.</description>
                  <value>#xxx1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OPAC32</name>
              <description>Off-platform Peripheral Access Control 32</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TP0</name>
                  <description>Accesses from an untrusted master are allowed.</description>
                  <value>#xxx0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TP1</name>
                  <description>Accesses from an untrusted master are not allowed. If an access is attempted by an untrusted master, the access is terminated with an error response and no peripheral access is initiated on the IPS bus.</description>
                  <value>#xxx1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
