Masmiseim36/nxpSDK/devices/MIMXRT1046/MIMXRT1046.xml
        <register>
          <name>GPR6</name>
          <description>GPR6 General Purpose Register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>QTIMER1_TRM0_INPUT_SEL</name>
              <description>QTIMER1 TMR0 input select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>QTIMER1_TRM0_INPUT_SEL_0</name>
                  <description>input from IOMUX</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QTIMER1_TRM0_INPUT_SEL_1</name>
                  <description>input from XBAR</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>QTIMER1_TRM1_INPUT_SEL</name>
              <description>QTIMER1 TMR1 input select</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>QTIMER1_TRM1_INPUT_SEL_0</name>
                  <description>input from IOMUX</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QTIMER1_TRM1_INPUT_SEL_1</name>
                  <description>input from XBAR</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>QTIMER1_TRM2_INPUT_SEL</name>
              <description>QTIMER1 TMR2 input select</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>QTIMER1_TRM2_INPUT_SEL_0</name>
                  <description>input from IOMUX</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QTIMER1_TRM2_INPUT_SEL_1</name>
                  <description>input from XBAR</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>QTIMER1_TRM3_INPUT_SEL</name>
              <description>QTIMER1 TMR3 input select</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>QTIMER1_TRM3_INPUT_SEL_0</name>
                  <description>input from IOMUX</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QTIMER1_TRM3_INPUT_SEL_1</name>
                  <description>input from XBAR</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>QTIMER2_TRM0_INPUT_SEL</name>
              <description>QTIMER2 TMR0 input select</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>QTIMER2_TRM0_INPUT_SEL_0</name>
                  <description>input from IOMUX</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QTIMER2_TRM0_INPUT_SEL_1</name>
                  <description>input from XBAR</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>QTIMER2_TRM1_INPUT_SEL</name>
              <description>QTIMER2 TMR1 input select</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>QTIMER2_TRM1_INPUT_SEL_0</name>
                  <description>input from IOMUX</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QTIMER2_TRM1_INPUT_SEL_1</name>
                  <description>input from XBAR</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>QTIMER2_TRM2_INPUT_SEL</name>
              <description>QTIMER2 TMR2 input select</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>QTIMER2_TRM2_INPUT_SEL_0</name>
                  <description>input from IOMUX</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QTIMER2_TRM2_INPUT_SEL_1</name>
                  <description>input from XBAR</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>QTIMER2_TRM3_INPUT_SEL</name>
              <description>QTIMER2 TMR3 input select</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>QTIMER2_TRM3_INPUT_SEL_0</name>
                  <description>input from IOMUX</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QTIMER2_TRM3_INPUT_SEL_1</name>
                  <description>input from XBAR</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>QTIMER3_TRM0_INPUT_SEL</name>
              <description>QTIMER3 TMR0 input select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>QTIMER3_TRM0_INPUT_SEL_0</name>
                  <description>input from IOMUX</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QTIMER3_TRM0_INPUT_SEL_1</name>
                  <description>input from XBAR</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>QTIMER3_TRM1_INPUT_SEL</name>
              <description>QTIMER3 TMR1 input select</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>QTIMER3_TRM1_INPUT_SEL_0</name>
                  <description>input from IOMUX</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QTIMER3_TRM1_INPUT_SEL_1</name>
                  <description>input from XBAR</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>QTIMER3_TRM2_INPUT_SEL</name>
              <description>QTIMER3 TMR2 input select</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>QTIMER3_TRM2_INPUT_SEL_0</name>
                  <description>input from IOMUX</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QTIMER3_TRM2_INPUT_SEL_1</name>
                  <description>input from XBAR</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>QTIMER3_TRM3_INPUT_SEL</name>
              <description>QTIMER3 TMR3 input select</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>QTIMER3_TRM3_INPUT_SEL_0</name>
                  <description>input from IOMUX</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QTIMER3_TRM3_INPUT_SEL_1</name>
                  <description>input from XBAR</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>QTIMER4_TRM0_INPUT_SEL</name>
              <description>QTIMER4 TMR0 input select</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>QTIMER4_TRM0_INPUT_SEL_0</name>
                  <description>input from IOMUX</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QTIMER4_TRM0_INPUT_SEL_1</name>
                  <description>input from XBAR</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>QTIMER4_TRM1_INPUT_SEL</name>
              <description>QTIMER4 TMR1 input select</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>QTIMER4_TRM1_INPUT_SEL_0</name>
                  <description>input from IOMUX</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QTIMER4_TRM1_INPUT_SEL_1</name>
                  <description>input from XBAR</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>QTIMER4_TRM2_INPUT_SEL</name>
              <description>QTIMER4 TMR2 input select</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>QTIMER4_TRM2_INPUT_SEL_0</name>
                  <description>input from IOMUX</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QTIMER4_TRM2_INPUT_SEL_1</name>
                  <description>input from XBAR</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>QTIMER4_TRM3_INPUT_SEL</name>
              <description>QTIMER4 TMR3 input select</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>QTIMER4_TRM3_INPUT_SEL_0</name>
                  <description>input from IOMUX</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QTIMER4_TRM3_INPUT_SEL_1</name>
                  <description>input from XBAR</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IOMUXC_XBAR_DIR_SEL_4</name>
              <description>IOMUXC XBAR_INOUT4 function direction select</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IOMUXC_XBAR_DIR_SEL_4_0</name>
                  <description>XBAR_INOUT as input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOMUXC_XBAR_DIR_SEL_4_1</name>
                  <description>XBAR_INOUT as output</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IOMUXC_XBAR_DIR_SEL_5</name>
              <description>IOMUXC XBAR_INOUT5 function direction select</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IOMUXC_XBAR_DIR_SEL_5_0</name>
                  <description>XBAR_INOUT as input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOMUXC_XBAR_DIR_SEL_5_1</name>
                  <description>XBAR_INOUT as output</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IOMUXC_XBAR_DIR_SEL_6</name>
              <description>IOMUXC XBAR_INOUT6 function direction select</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IOMUXC_XBAR_DIR_SEL_6_0</name>
                  <description>XBAR_INOUT as input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOMUXC_XBAR_DIR_SEL_6_1</name>
                  <description>XBAR_INOUT as output</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IOMUXC_XBAR_DIR_SEL_7</name>
              <description>IOMUXC XBAR_INOUT7 function direction select</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IOMUXC_XBAR_DIR_SEL_7_0</name>
                  <description>XBAR_INOUT as input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOMUXC_XBAR_DIR_SEL_7_1</name>
                  <description>XBAR_INOUT as output</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IOMUXC_XBAR_DIR_SEL_8</name>
              <description>IOMUXC XBAR_INOUT8 function direction select</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IOMUXC_XBAR_DIR_SEL_8_0</name>
                  <description>XBAR_INOUT as input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOMUXC_XBAR_DIR_SEL_8_1</name>
                  <description>XBAR_INOUT as output</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IOMUXC_XBAR_DIR_SEL_9</name>
              <description>IOMUXC XBAR_INOUT9 function direction select</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IOMUXC_XBAR_DIR_SEL_9_0</name>
                  <description>XBAR_INOUT as input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOMUXC_XBAR_DIR_SEL_9_1</name>
                  <description>XBAR_INOUT as output</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IOMUXC_XBAR_DIR_SEL_10</name>
              <description>IOMUXC XBAR_INOUT10 function direction select</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IOMUXC_XBAR_DIR_SEL_10_0</name>
                  <description>XBAR_INOUT as input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOMUXC_XBAR_DIR_SEL_10_1</name>
                  <description>XBAR_INOUT as output</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IOMUXC_XBAR_DIR_SEL_11</name>
              <description>IOMUXC XBAR_INOUT11 function direction select</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IOMUXC_XBAR_DIR_SEL_11_0</name>
                  <description>XBAR_INOUT as input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOMUXC_XBAR_DIR_SEL_11_1</name>
                  <description>XBAR_INOUT as output</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IOMUXC_XBAR_DIR_SEL_12</name>
              <description>IOMUXC XBAR_INOUT12 function direction select</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IOMUXC_XBAR_DIR_SEL_12_0</name>
                  <description>XBAR_INOUT as input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOMUXC_XBAR_DIR_SEL_12_1</name>
                  <description>XBAR_INOUT as output</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IOMUXC_XBAR_DIR_SEL_13</name>
              <description>IOMUXC XBAR_INOUT13 function direction select</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IOMUXC_XBAR_DIR_SEL_13_0</name>
                  <description>XBAR_INOUT as input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOMUXC_XBAR_DIR_SEL_13_1</name>
                  <description>XBAR_INOUT as output</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IOMUXC_XBAR_DIR_SEL_14</name>
              <description>IOMUXC XBAR_INOUT14 function direction select</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IOMUXC_XBAR_DIR_SEL_14_0</name>
                  <description>XBAR_INOUT as input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOMUXC_XBAR_DIR_SEL_14_1</name>
                  <description>XBAR_INOUT as output</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IOMUXC_XBAR_DIR_SEL_15</name>
              <description>IOMUXC XBAR_INOUT15 function direction select</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IOMUXC_XBAR_DIR_SEL_15_0</name>
                  <description>XBAR_INOUT as input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOMUXC_XBAR_DIR_SEL_15_1</name>
                  <description>XBAR_INOUT as output</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IOMUXC_XBAR_DIR_SEL_16</name>
              <description>IOMUXC XBAR_INOUT16 function direction select</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IOMUXC_XBAR_DIR_SEL_16_0</name>
                  <description>XBAR_INOUT as input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOMUXC_XBAR_DIR_SEL_16_1</name>
                  <description>XBAR_INOUT as output</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IOMUXC_XBAR_DIR_SEL_17</name>
              <description>IOMUXC XBAR_INOUT17 function direction select</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IOMUXC_XBAR_DIR_SEL_17_0</name>
                  <description>XBAR_INOUT as input</description>
