Masmiseim36/nxpSDK/devices/MIMXRT1046/MIMXRT1046.xml
        <register>
          <name>FLEXCAN2_RX_SELECT_INPUT</name>
          <description>FLEXCAN2_RX_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x450</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_EMC_10_ALT3</name>
                  <description>Selecting Pad: GPIO_EMC_10 for Mode: ALT3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_AD_B0_15_ALT6</name>
                  <description>Selecting Pad: GPIO_AD_B0_15 for Mode: ALT6</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_B1_09_ALT6</name>
                  <description>Selecting Pad: GPIO_B1_09 for Mode: ALT6</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLEXPWM1_PWMA3_SELECT_INPUT</name>
          <description>FLEXPWM1_PWMA3_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x454</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_SD_B1_00_ALT2</name>
                  <description>Selecting Pad: GPIO_SD_B1_00 for Mode: ALT2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_EMC_12_ALT4</name>
                  <description>Selecting Pad: GPIO_EMC_12 for Mode: ALT4</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_EMC_38_ALT1</name>
                  <description>Selecting Pad: GPIO_EMC_38 for Mode: ALT1</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_AD_B0_10_ALT1</name>
                  <description>Selecting Pad: GPIO_AD_B0_10 for Mode: ALT1</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_B1_00_ALT6</name>
                  <description>Selecting Pad: GPIO_B1_00 for Mode: ALT6</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLEXPWM1_PWMA0_SELECT_INPUT</name>
          <description>FLEXPWM1_PWMA0_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x458</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_EMC_23_ALT1</name>
                  <description>Selecting Pad: GPIO_EMC_23 for Mode: ALT1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_SD_B0_00_ALT1</name>
                  <description>Selecting Pad: GPIO_SD_B0_00 for Mode: ALT1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLEXPWM1_PWMA1_SELECT_INPUT</name>
          <description>FLEXPWM1_PWMA1_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x45C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_EMC_25_ALT1</name>
                  <description>Selecting Pad: GPIO_EMC_25 for Mode: ALT1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_SD_B0_02_ALT1</name>
                  <description>Selecting Pad: GPIO_SD_B0_02 for Mode: ALT1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLEXPWM1_PWMA2_SELECT_INPUT</name>
          <description>FLEXPWM1_PWMA2_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x460</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_EMC_27_ALT1</name>
                  <description>Selecting Pad: GPIO_EMC_27 for Mode: ALT1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_SD_B0_04_ALT1</name>
                  <description>Selecting Pad: GPIO_SD_B0_04 for Mode: ALT1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLEXPWM1_PWMB3_SELECT_INPUT</name>
          <description>FLEXPWM1_PWMB3_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x464</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_SD_B1_01_ALT2</name>
                  <description>Selecting Pad: GPIO_SD_B1_01 for Mode: ALT2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_EMC_13_ALT4</name>
                  <description>Selecting Pad: GPIO_EMC_13 for Mode: ALT4</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_EMC_39_ALT1</name>
                  <description>Selecting Pad: GPIO_EMC_39 for Mode: ALT1</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_AD_B0_11_ALT1</name>
                  <description>Selecting Pad: GPIO_AD_B0_11 for Mode: ALT1</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_B1_01_ALT6</name>
                  <description>Selecting Pad: GPIO_B1_01 for Mode: ALT6</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLEXPWM1_PWMB0_SELECT_INPUT</name>
          <description>FLEXPWM1_PWMB0_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x468</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_EMC_24_ALT1</name>
                  <description>Selecting Pad: GPIO_EMC_24 for Mode: ALT1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_SD_B0_01_ALT1</name>
                  <description>Selecting Pad: GPIO_SD_B0_01 for Mode: ALT1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLEXPWM1_PWMB1_SELECT_INPUT</name>
          <description>FLEXPWM1_PWMB1_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x46C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_EMC_26_ALT1</name>
                  <description>Selecting Pad: GPIO_EMC_26 for Mode: ALT1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_SD_B0_03_ALT1</name>
                  <description>Selecting Pad: GPIO_SD_B0_03 for Mode: ALT1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLEXPWM1_PWMB2_SELECT_INPUT</name>
          <description>FLEXPWM1_PWMB2_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x470</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_EMC_28_ALT1</name>
                  <description>Selecting Pad: GPIO_EMC_28 for Mode: ALT1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_SD_B0_05_ALT1</name>
                  <description>Selecting Pad: GPIO_SD_B0_05 for Mode: ALT1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLEXPWM2_PWMA3_SELECT_INPUT</name>
          <description>FLEXPWM2_PWMA3_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x474</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_SD_B1_02_ALT2</name>
                  <description>Selecting Pad: GPIO_SD_B1_02 for Mode: ALT2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_EMC_19_ALT1</name>
                  <description>Selecting Pad: GPIO_EMC_19 for Mode: ALT1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_AD_B0_09_ALT1</name>
                  <description>Selecting Pad: GPIO_AD_B0_09 for Mode: ALT1</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_B1_02_ALT6</name>
                  <description>Selecting Pad: GPIO_B1_02 for Mode: ALT6</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLEXPWM2_PWMA0_SELECT_INPUT</name>
          <description>FLEXPWM2_PWMA0_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x478</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_EMC_06_ALT1</name>
                  <description>Selecting Pad: GPIO_EMC_06 for Mode: ALT1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_B0_06_ALT2</name>
                  <description>Selecting Pad: GPIO_B0_06 for Mode: ALT2</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLEXPWM2_PWMA1_SELECT_INPUT</name>
          <description>FLEXPWM2_PWMA1_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x47C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_EMC_08_ALT1</name>
                  <description>Selecting Pad: GPIO_EMC_08 for Mode: ALT1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_B0_08_ALT2</name>
                  <description>Selecting Pad: GPIO_B0_08 for Mode: ALT2</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLEXPWM2_PWMA2_SELECT_INPUT</name>
          <description>FLEXPWM2_PWMA2_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x480</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_EMC_10_ALT1</name>
                  <description>Selecting Pad: GPIO_EMC_10 for Mode: ALT1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_B0_10_ALT2</name>
                  <description>Selecting Pad: GPIO_B0_10 for Mode: ALT2</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLEXPWM2_PWMB3_SELECT_INPUT</name>
          <description>FLEXPWM2_PWMB3_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x484</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_SD_B1_03_ALT2</name>
                  <description>Selecting Pad: GPIO_SD_B1_03 for Mode: ALT2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_EMC_20_ALT1</name>
                  <description>Selecting Pad: GPIO_EMC_20 for Mode: ALT1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_B1_03_ALT6</name>
                  <description>Selecting Pad: GPIO_B1_03 for Mode: ALT6</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLEXPWM2_PWMB0_SELECT_INPUT</name>
          <description>FLEXPWM2_PWMB0_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x488</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_EMC_07_ALT1</name>
                  <description>Selecting Pad: GPIO_EMC_07 for Mode: ALT1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_B0_07_ALT2</name>
                  <description>Selecting Pad: GPIO_B0_07 for Mode: ALT2</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLEXPWM2_PWMB1_SELECT_INPUT</name>
          <description>FLEXPWM2_PWMB1_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x48C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_EMC_09_ALT1</name>
                  <description>Selecting Pad: GPIO_EMC_09 for Mode: ALT1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_B0_09_ALT2</name>
                  <description>Selecting Pad: GPIO_B0_09 for Mode: ALT2</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLEXPWM2_PWMB2_SELECT_INPUT</name>
          <description>FLEXPWM2_PWMB2_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x490</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_EMC_11_ALT1</name>
                  <description>Selecting Pad: GPIO_EMC_11 for Mode: ALT1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_B0_11_ALT2</name>
                  <description>Selecting Pad: GPIO_B0_11 for Mode: ALT2</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
