Masmiseim36/nxpSDK/devices/MIMXRT1046/MIMXRT1046.xml
        <register>
          <name>HOST_CTRL_CAP</name>
          <description>Host Controller Capabilities</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x7F3B407</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SDR50_SUPPORT</name>
              <description>SDR50 support</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SDR104_SUPPORT</name>
              <description>SDR104 support</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DDR50_SUPPORT</name>
              <description>DDR50 support</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>USE_TUNING_SDR50</name>
              <description>Use Tuning for SDR50</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USE_TUNING_b</name>
                  <description>SDR50 does not support tuning</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USE_TUNING_a</name>
                  <description>SDR50 supports tuning</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MBL</name>
              <description>Max block length</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MBL_a</name>
                  <description>512 bytes</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MBL_B</name>
                  <description>1024 bytes</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MBL_C</name>
                  <description>2048 bytes</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MBL_D</name>
                  <description>4096 bytes</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADMAS</name>
              <description>ADMA support</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADMAS_B</name>
                  <description>Advanced DMA not supported</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADMAS_a</name>
                  <description>Advanced DMA supported</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HSS</name>
              <description>High speed support</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HSS_B</name>
                  <description>High speed not supported</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSS_a</name>
                  <description>High speed supported</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMAS</name>
              <description>DMA support</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMAS_B</name>
                  <description>DMA not supported</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAS_a</name>
                  <description>DMA supported</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRS</name>
              <description>Suspend / resume support</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SRS_B</name>
                  <description>Not supported</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRS_a</name>
                  <description>Supported</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VS33</name>
              <description>Voltage support 3.3 V</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VS33_b</name>
                  <description>3.3 V not supported</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VS33_a</name>
                  <description>3.3 V supported</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VS30</name>
              <description>Voltage support 3.0 V</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VS30_b</name>
                  <description>3.0 V not supported</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VS30_a</name>
                  <description>3.0 V supported</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VS18</name>
              <description>Voltage support 1.8 V</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VS18_B</name>
                  <description>1.8 V not supported</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VS18_a</name>
                  <description>1.8 V supported</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>WTMK_LVL</name>
          <description>Watermark Level</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x8100810</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RD_WML</name>
              <description>Read watermark level</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RD_BRST_LEN</name>
              <description>Read burst length due to system restriction, the actual burst length might not exceed 16</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WR_WML</name>
              <description>Write watermark level</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WR_BRST_LEN</name>
              <description>Write burst length due to system restriction, the actual burst length might not exceed 16</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MIX_CTRL</name>
          <description>Mixer Control</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x80000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DMAEN</name>
              <description>DMA enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMAIN_B</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAIN_a</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BCEN</name>
              <description>Block count enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BCEN_B</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BCEN_a</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AC12EN</name>
              <description>Auto CMD12 enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AC12EN_B</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AC12EN_a</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DDR_EN</name>
              <description>Dual data rate mode selection</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DTDSEL</name>
              <description>Data transfer direction select</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DTDSEL_B</name>
                  <description>Write (Host to card)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTDSEL_a</name>
                  <description>Read (Card to host)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MSBSEL</name>
              <description>Multi / Single block select</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MSBSEL_B</name>
                  <description>Single block</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSBSEL_a</name>
                  <description>Multiple blocks</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NIBBLE_POS</name>
              <description>Nibble position indication</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AC23EN</name>
              <description>Auto CMD23 enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXE_TUNE</name>
              <description>Execute tuning: (Only used for SD3.0, SDR104 mode and eMMC HS200 mode)</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EXE_TUNE_D</name>
                  <description>Not tuned or tuning completed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXE_TUNE_C</name>
                  <description>Execute tuning</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SMP_CLK_SEL</name>
              <description>Clock selection</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SMPSEL_B</name>
                  <description>Fixed clock is used to sample data / cmd</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SMPSEL_a</name>
                  <description>Tuned clock is used to sample data / cmd</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AUTO_TUNE_EN</name>
              <description>Auto tuning enable (Only used for SD3.0, SDR104 mode and and eMMC HS200 mode)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AUTOTUNE_B</name>
                  <description>Disable auto tuning</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUTO_TUNE_a</name>
                  <description>Enable auto tuning</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FBCLK_SEL</name>
              <description>Feedback clock source selection (Only used for SD3.0, SDR104 mode and eMMC HS200 mode)</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FBCLK_B</name>
                  <description>Feedback clock comes from the loopback CLK</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FBCLK_a</name>
                  <description>Feedback clock comes from the ipp_card_clk_out</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FORCE_EVENT</name>
          <description>Force Event</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FEVTAC12NE</name>
              <description>Force event auto command 12 not executed</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FEVTAC12TOE</name>
              <description>Force event auto command 12 time out error</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FEVTAC12CE</name>
              <description>Force event auto command 12 CRC error</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FEVTAC12EBE</name>
              <description>Force event Auto Command 12 end bit error</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FEVTAC12IE</name>
              <description>Force event Auto Command 12 index error</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FEVTCNIBAC12E</name>
              <description>Force event command not executed by Auto Command 12 error</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FEVTCTOE</name>
              <description>Force event command time out error</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FEVTCCE</name>
              <description>Force event command CRC error</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FEVTCEBE</name>
              <description>Force event command end bit error</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FEVTCIE</name>
              <description>Force event command index error</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FEVTDTOE</name>
              <description>Force event data time out error</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FEVTDCE</name>
              <description>Force event data CRC error</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FEVTDEBE</name>
              <description>Force event data end bit error</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FEVTAC12E</name>
              <description>Force event Auto Command 12 error</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FEVTTNE</name>
              <description>Force tuning error</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FEVTDMAE</name>
              <description>Force event DMA error</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FEVTCINT</name>
              <description>Force event card interrupt</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
