Masmiseim36/nxpSDK/devices/MIMXRT1046/MIMXRT1046.xml
        <register>
          <dim>9</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>BR[%s]</name>
          <description>Base Register n</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VLD</name>
              <description>Valid</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VLD_0</name>
                  <description>The memory is invalid, can not be accessed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VLD_1</name>
                  <description>The memory is valid, can be accessed.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MS</name>
              <description>Memory size</description>
              <bitOffset>1</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MS_0</name>
                  <description>4KB</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_1</name>
                  <description>8KB</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_2</name>
                  <description>16KB</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_3</name>
                  <description>32KB</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_4</name>
                  <description>64KB</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_5</name>
                  <description>128KB</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_6</name>
                  <description>256KB</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_7</name>
                  <description>512KB</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_8</name>
                  <description>1MB</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_9</name>
                  <description>2MB</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_10</name>
                  <description>4MB</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_11</name>
                  <description>8MB</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_12</name>
                  <description>16MB</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_13</name>
                  <description>32MB</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_14</name>
                  <description>64MB</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_15</name>
                  <description>128MB</description>
                  <value>0xF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_16</name>
                  <description>256MB</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_17</name>
                  <description>512MB</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_18</name>
                  <description>1GB</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_19</name>
                  <description>2GB</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_20</name>
                  <description>4GB</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_21</name>
                  <description>4GB</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_22</name>
                  <description>4GB</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_23</name>
                  <description>4GB</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_24</name>
                  <description>4GB</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_25</name>
                  <description>4GB</description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_26</name>
                  <description>4GB</description>
                  <value>0x1A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_27</name>
                  <description>4GB</description>
                  <value>0x1B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_28</name>
                  <description>4GB</description>
                  <value>0x1C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_29</name>
                  <description>4GB</description>
                  <value>0x1D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_30</name>
                  <description>4GB</description>
                  <value>0x1E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MS_31</name>
                  <description>4GB</description>
                  <value>0x1F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BA</name>
              <description>Base Address</description>
              <bitOffset>12</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DLLCR</name>
          <description>DLL Control Register</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x100</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DLLEN</name>
              <description>DLL calibration enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DLLEN_0</name>
                  <description>DLL calibration is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLLEN_1</name>
                  <description>DLL calibration is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DLLRESET</name>
              <description>DLL Reset</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DLLRESET_0</name>
                  <description>DLL is not reset.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DLLRESET_1</name>
                  <description>DLL is reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SLVDLYTARGET</name>
              <description>Delay Target for Slave</description>
              <bitOffset>3</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OVRDEN</name>
              <description>Override Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OVRDEN_0</name>
                  <description>The delay cell number is not overridden.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OVRDEN_1</name>
                  <description>The delay cell number is overridden.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OVRDVAL</name>
              <description>Override Value</description>
              <bitOffset>9</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTEN</name>
          <description>Interrupt Enable Register</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IPCMDDONEEN</name>
              <description>IP command done interrupt enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IPCMDDONEEN_0</name>
                  <description>Interrupt is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IPCMDDONEEN_1</name>
                  <description>Interrupt is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IPCMDERREN</name>
              <description>IP command error interrupt enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IPCMDERREN_0</name>
                  <description>Interrupt is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IPCMDERREN_1</name>
                  <description>Interrupt is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AXICMDERREN</name>
              <description>AXI command error interrupt enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AXICMDERREN_0</name>
                  <description>Interrupt is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AXICMDERREN_1</name>
                  <description>Interrupt is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AXIBUSERREN</name>
              <description>AXI bus error interrupt enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AXIBUSERREN_0</name>
                  <description>Interrupt is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AXIBUSERREN_1</name>
                  <description>Interrupt is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NDPAGEENDEN</name>
              <description>NAND page end interrupt enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NDPAGEENDEN_0</name>
                  <description>Interrupt is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NDPAGEENDEN_1</name>
                  <description>Interrupt is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NDNOPENDEN</name>
              <description>NAND no pending AXI access interrupt enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NDNOPENDEN_0</name>
                  <description>Interrupt is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NDNOPENDEN_1</name>
                  <description>Interrupt is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTR</name>
          <description>Interrupt Register</description>
          <addressOffset>0x3C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <modifiedWriteValues>oneToClear</modifiedWriteValues>
          <fields>
            <field>
              <name>IPCMDDONE</name>
              <description>IP command normal done interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IPCMDDONE_0</name>
                  <description>IP command is not done.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IPCMDDONE_1</name>
                  <description>IP command is done.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IPCMDERR</name>
              <description>IP command error done interrupt</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IPCMDERR_0</name>
                  <description>No IP command error.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IPCMDERR_1</name>
                  <description>IP command error occurs.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AXICMDERR</name>
              <description>AXI command error interrupt</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AXICMDERR_0</name>
                  <description>No AXI command error.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AXICMDERR_1</name>
                  <description>AXI command error occurs.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AXIBUSERR</name>
              <description>AXI bus error interrupt</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AXIBUSERR_0</name>
                  <description>No AXI bus error.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AXIBUSERR_1</name>
                  <description>AXI bus error occurs.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NDPAGEEND</name>
              <description>NAND page end interrupt</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NDPAGEEND_0</name>
                  <description>The last address of main space in the NAND is not written by AXI command.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NDPAGEEND_1</name>
                  <description>The last address of main space in the NAND is written by AXI command.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NDNOPEND</name>
              <description>NAND no pending AXI write transaction interrupt</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NDNOPEND_0</name>
                  <description>At least one NAND AXI write transaction is pending or no NAND write transaction is sent to the queue.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NDNOPEND_1</name>
                  <description>All NAND AXI write pending transactions are finished.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
