Masmiseim36/nxpSDK/devices/MIMXRT1046/MIMXRT1046.xml
        <register>
          <name>TRIG2_CHAIN_3_2</name>
          <description>ETC_TRIG Chain 2/3 Register</description>
          <addressOffset>0x6C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CSEL2</name>
              <description>ADC channel selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CSEL2_0</name>
                  <description>ADC Channel 0 selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL2_1</name>
                  <description>ADC Channel 1 selected.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL2_2</name>
                  <description>ADC Channel 2 selected.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL2_3</name>
                  <description>ADC Channel 3 selected.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL2_4</name>
                  <description>ADC Channel 4 selected.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL2_5</name>
                  <description>ADC Channel 5 selected.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL2_6</name>
                  <description>ADC Channel 6 selected.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL2_7</name>
                  <description>ADC Channel 7 selected.</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL2_8</name>
                  <description>ADC Channel 8 selected.</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL2_9</name>
                  <description>ADC Channel 9 selected.</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL2_10</name>
                  <description>ADC Channel 10 selected.</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL2_11</name>
                  <description>ADC Channel 11 selected.</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL2_12</name>
                  <description>ADC Channel 12 selected.</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL2_13</name>
                  <description>ADC Channel 13 selected.</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL2_14</name>
                  <description>ADC Channel 14 selected.</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL2_15</name>
                  <description>ADC Channel 15 selected.</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HWTS2</name>
              <description>Segment 2 HWTS ADC hardware trigger selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HWTS2_0</name>
                  <description>no trigger selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HWTS2_1</name>
                  <description>ADC TRIG0 selected</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HWTS2_2</name>
                  <description>ADC TRIG1 selected</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HWTS2_4</name>
                  <description>ADC TRIG2 selected</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HWTS2_8</name>
                  <description>ADC TRIG3 selected</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HWTS2_16</name>
                  <description>ADC TRIG4 selected</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HWTS2_32</name>
                  <description>ADC TRIG5 selected</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HWTS2_64</name>
                  <description>ADC TRIG6 selected</description>
                  <value>0x40</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HWTS2_128</name>
                  <description>ADC TRIG7 selected</description>
                  <value>0x80</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>B2B2</name>
              <description>Segment 2 B2B</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B2B2_0</name>
                  <description>Disable B2B. Wait until delay value defined by TRIG2_COUNTER[SAMPLE_INTERVAL] is reached</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B2B2_1</name>
                  <description>Enable B2B. When Segment 0 finished (ADC COCO) then automatically trigger next ADC conversion, no need to wait until interval delay reached.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IE2</name>
              <description>Segment 2 done interrupt selection</description>
              <bitOffset>13</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IE2_0</name>
                  <description>No interrupt when finished</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IE2_1</name>
                  <description>Generate interrupt on Done0 when segment 2 finish.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IE2_2</name>
                  <description>Generate interrupt on Done1 when segment 2 finish.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IE2_3</name>
                  <description>Generate interrupt on Done2 when segment 2 finish.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CSEL3</name>
              <description>ADC channel selection</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CSEL3_0</name>
                  <description>ADC Channel 0 selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL3_1</name>
                  <description>ADC Channel 1 selected.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL3_2</name>
                  <description>ADC Channel 2 selected.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL3_3</name>
                  <description>ADC Channel 3 selected.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL3_4</name>
                  <description>ADC Channel 4 selected.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL3_5</name>
                  <description>ADC Channel 5 selected.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL3_6</name>
                  <description>ADC Channel 6 selected.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL3_7</name>
                  <description>ADC Channel 7 selected.</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL3_8</name>
                  <description>ADC Channel 8 selected.</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL3_9</name>
                  <description>ADC Channel 9 selected.</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL3_10</name>
                  <description>ADC Channel 10 selected.</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL3_11</name>
                  <description>ADC Channel 11 selected.</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL3_12</name>
                  <description>ADC Channel 12 selected.</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL3_13</name>
                  <description>ADC Channel 13 selected.</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL3_14</name>
                  <description>ADC Channel 14 selected.</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSEL3_15</name>
                  <description>ADC Channel 15 selected.</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HWTS3</name>
              <description>Segment 3 HWTS ADC hardware trigger selection</description>
              <bitOffset>20</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HWTS3_0</name>
                  <description>no trigger selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HWTS3_1</name>
                  <description>ADC TRIG0 selected</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HWTS3_2</name>
                  <description>ADC TRIG1 selected</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HWTS3_4</name>
                  <description>ADC TRIG2 selected</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HWTS3_8</name>
                  <description>ADC TRIG3 selected</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HWTS3_16</name>
                  <description>ADC TRIG4 selected</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HWTS3_32</name>
                  <description>ADC TRIG5 selected</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HWTS3_64</name>
                  <description>ADC TRIG6 selected</description>
                  <value>0x40</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HWTS3_128</name>
                  <description>ADC TRIG7 selected</description>
                  <value>0x80</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>B2B3</name>
              <description>Segment 3 B2B</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B2B3_0</name>
                  <description>Disable B2B. Wait until delay value defined by TRIG3_COUNTER[SAMPLE_INTERVAL] is reached</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B2B3_1</name>
                  <description>Enable B2B. When Segment 0 finished (ADC COCO) then automatically trigger next ADC conversion, no need to wait until interval delay reached.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IE3</name>
              <description>Segment 3 done interrupt selection</description>
              <bitOffset>29</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IE3_0</name>
                  <description>No interrupt when finished</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IE3_1</name>
                  <description>Generate interrupt on Done0 when segment 3 finish.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IE3_2</name>
                  <description>Generate interrupt on Done1 when segment 3 finish.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IE3_3</name>
                  <description>Generate interrupt on Done2 when segment 3 finish.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
